# ExternallyTaggedNonBReps Properties

---
The ExternallyTaggedNonBReps type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace